app/controllers/contacts_controller.rb

SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @contact = Contact.find(params[:id])

INSERT INTO "contacts" ("created_at", "email", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 10 May 2013 11:43:37 UTC +00:00], ["email", "dhara@joshi.com"], ["name", "Dhara"], ["updated_at", Fri, 10 May 2013 11:43:37 UTC +00:00]]
---
  def create
    @contact = Contact.new(params[:contact])

    respond_to do |format|
      if @contact.save